openFOAM/cavityChannelWithStep/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0.5 0)
    (0.5 0.5 0)
    (0.5 1 0)
    (0 1 0)
    (0.5 0 0)
    (5 0 0)
    (5 0.5 0)
    (5 1 0)

    (0 0.5 0.1)
    (0.5 0.5 0.1)
    (0.5 1 0.1)
    (0 1 0.1)
    (0.5 0 0.1)
    (5 0 0.1)
    (5 0.5 0.1)
    (5 1 0.1)
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (5 5 1) simpleGrading (1 1 1)
    hex (4 5 6 1 12 13 14 9) (45 5 1) simpleGrading (1 1 1)
    hex (1 6 7 2 9 14 15 10) (45 5 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fixedWalls
    {
        type wall;
        faces
        (
            (2 10 11 3)
            (7 15 10 2)
            (1 9 8 0)
            (4 12 9 1)
            (5 13 12 4)
        );
    }

    inflowWall
    {
        type wall;
        faces
        (
            (3 11 8 0)
        );
    }

    outflowWall
    {
        type wall;
        faces
        (
            (5 13 14 6)
            (6 14 15 7)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 1)
            (1 6 7 2)
            (8 9 10 11)
            (12 13 14 9)
            (9 14 15 10)
        );
    }
);


// ************************************************************************* //
